Tutorials/vortexShed/system/CurleControl
CurleAnalogyCylinder
{
        type            CurleAnalogy;
        #include        "commonSettings";
        patches (cylinder);
}











